/* [16.01.2018, 20:49:10] Alexey Shkumat: Михаил, если я правильно понял, то задача следующая.
Нужно создать объект "микроволновка" класса Microwave,
а также объект "кофеварка" класса CoffeeMachine.
Оба эти класса Microwave и CoffeeMachine являются потомками класса Machine.
Это схематически показано на рисунке выше. И "микроволновка" и "кофеварка"
должны уметь работать в течение  заданного промежутка времени (через setTimeout).
И вот надо с помощью  "кофеварки" "приготовить" какой-нибудь кофе,
а с помощью "микроволновки" "разогреть" чего-нибудь.
[16.01.2018, 20:50:04] Alexey Shkumat: Задачу требуется решить двумя способами:
1. через классы
2. через прототипы.
*/


class machine {
  constructor(name) {
    this.manuf = manuf;
    this.model = model;
    this.type = type;
  }
  status() {

    }
}
